Repository: kkoliou/Vocabulary
Catalog: Vocabulary/VocabularyModules/Sources/Shared/Localizable.xcstrings
Source language: en
Languages: el

source: Add
el: Προσθήκη

# Add Entry
source: Add New Entry
el: Προσθήκη καταχώρισης

# Add some vocabulary entries to practice
source: Add a few words to start practicing
el: Πρόσθεσε μερικές λέξεις για εξάσκηση

source: Add Vocabulary
el: Προσθήκη λεξιλογίου

source: Set the likelihood that the original word will be hidden instead of the translation. At 50%, each has an equal chance of being hidden.
el: Ρύθμισε την πιθανότητα να αποκρύπτεται η αρχική λέξη αντί για τη μετάφραση. Στο 50%, κάθε μία έχει ίση πιθανότητα να κρυφτεί.

# Alphabetical
source: Alphabetical Order
el: Αλφαβητικά

source: Always hide original
el: Πάντα απόκρυψη αρχικής

source: Always hide translation
el: Πάντα απόκρυψη μετάφρασης

# An entry with this original word already exists in this vocabulary
source: This word is already in your vocabulary list
el: Υπάρχει ήδη καταχώριση με αυτή τη λέξη σε αυτό το λεξιλόγιο

# Auto Reveal Hidden Word
source: Auto-reveal translation
el: Αυτόματη εμφάνιση μετάφρασης

# Automatically reveal the hidden word for all words
source: Automatically reveal the translation for all entries.
el: Να εμφανίζεται αυτόματα η μετάφραση για όλες τις λέξεις.

source: Cancel
el: Άκυρο

source: chance to hide original
el: πιθανότητα απόκρυψης αρχικής

# Choose a descriptive name to organize your learning.
source: Choose a clear name to organize your learning.
el: Δώσε ένα όνομα για τη λίστα σου

# Choose CSV File
source: Choose a CSV File
el: Επιλογή αρχείου CSV

# Could not read the selected file. Please try again.
source: We couldn’t read that file. Please try again.
el: Δεν ήταν δυνατή η ανάγνωση του αρχείου. Προσπάθησε ξανά.

source: Create
el: Δημιουργία

# Create new practice?
source: Start a new practice session?
el: Να δημιουργηθεί νέα εξάσκηση;

# Create your first word list to start studying.
source: Create your first word list to begin studying.
el: Δημιούργησε την πρώτη σου λίστα λέξεων για να ξεκινήσεις την εξάσκηση.

source: CSV Format
el: Μορφή CSV

source: Default
el: Προεπιλογή

source: Delete
el: Διαγραφή

source: Edit
el: Επεξεργασία

source: Edit Entry
el: Επεξεργασία καταχώρισης

# Error
source: Something went wrong
el: Σφάλμα

source: File
el: Αρχείο

source: First column: Original word or phrase
el: Πρώτη στήλη: Αρχική λέξη ή φράση

source: Hidden word randomness
el: Ποια λέξη να κρυφτεί

source: Highlight
el: Επισήμανση

source: How It Works
el: Πώς δουλεύει

# Import File
source: Import a File
el: Εισαγωγή αρχείου

# Import from File
source: Import from a File
el: Εισαγωγή από αρχείο

# New Vocabulary
source: New Vocabulary List
el: Νέο λεξιλόγιο

# No entries
source: No words yet
el: Δεν υπάρχουν καταχωρίσεις

# No vocabulary yet
source: You don’t have any vocabulary lists yet
el: Δεν υπάρχει ακόμη λεξιλόγιο

source: Some rows are missing the word or translation. Please check your CSV file.
el: Κάποιες γραμμές δεν έχουν και τις δύο στήλες. Έλεγξε το αρχείο.

# Original
source: Original Word
el: Αρχική λέξη

# Pending practice
source: Practice waiting
el: Εκκρεμής εξάσκηση

# Pending practices
source: Practices waiting
el: Εκκρεμείς εξασκήσεις

source: Practice
el: Εξάσκηση

# Provide a vocabulary name
source: Please enter a name for your vocabulary list
el: Δώσε ένα όνομα στο λεξιλόγιο

# Provide both original and translation
source: Please enter both the word and its translation
el: Βάλε τη λέξη και τη μετάφραση

source: Remove Highlight
el: Αφαίρεση επισήμανσης

source: Reveal
el: Αποκάλυψη

source: Save
el: Αποθήκευση

# Search in vocabulary
source: Search your vocabulary
el: Αναζήτηση στο λεξιλόγιο

source: Second column: Translation
el: Δεύτερη στήλη: Μετάφραση

source: Select a CSV file from your device
el: Επίλεξε ένα αρχείο CSV από τη συσκευή σου

source: Settings
el: Ρυθμίσεις

source: Something went wrong
el: Κάτι πήγε στραβά

source: Something went wrong.
el: Κάτι πήγε στραβά.

source: Sort
el: Ταξινόμηση

source: Sort by
el: Ταξινόμηση κατά

source: That file format isn’t valid. Make sure your CSV uses commas to separate values.
el: Η μορφή του αρχείου δεν είναι έγκυρη. Βεβαιώσου ότι το CSV χρησιμοποιεί κόμματα για τον διαχωρισμό των τιμών.

# The vocabulary already exists
source: A vocabulary list with this name already exists
el: Το λεξιλόγιο υπάρχει ήδη

# Tip: You can use your AI agent to help generate a properly formatted CSV file.
source: Tip: You can use AI to help generate a properly formatted CSV file.
el: Συμβουλή: Χρησιμοποίησε AI για να σου φτιάξει ένα αρχείο CSV.

source: Translation
el: Μετάφραση

# Vocabularies
source: Vocabulary Lists
el: Λεξιλόγια

source: Vocabulary
el: Λεξιλόγιο

# Vocabulary name
source: Vocabulary List Name
el: Όνομα λεξιλογίου

source: Word or Phrase
el: Λέξη ή φράση

source: You already have a practice session waiting. Starting a new one will replace it. Continue?
el: Έχεις ήδη μια εκκρεμή εξάσκηση. Αν δημιουργήσεις νέα, θα αντικαταστήσει την υπάρχουσα. Θέλεις να συνεχίσεις;

# Your CSV file should have two columns:
source: Your CSV file should include two columns:
el: Το αρχείο πρέπει να έχει δύο στήλες:

source: Your Translation
el: Η μετάφρασή σου
